'''rule기반 모든 조건들을 알려주는 코드작성 방법
AI 응용 어플리케이션 개발분야
AI 기반 기술개발 분야
AI H/W 기술개발 분야
한국전자통신연구원 AI 

지능 Intelligence: 
본능적이나 자동적으로 행동한는 대신에 생가가혹 이해하여 행동하는 능력

인공지능 :
인공적으로 만든 지능 
인간의 학습능력 , 추론능력 , 지각능력 , 그외의 인공적으로 구현한 컴퓨터 프로그램 또는 이를 포함한 컴퓨터 시스템
인간을 포함한 동물이 갖고 있는 지능 즉 , nature intelligence와 다른 개념 

인간에게 "어렵다" 고 여겨지는 행위
체스나 바둑 , 금융 시장에서 투자 결정 내리기 등은 컴퓨터로 비교적 쉽게 처리할 수 있는 반면 
사진 보고 개와 고양이 구분하기 등등 인간이 쉽게 해내는 행위를 컴퓨터로 구현해 내기는 어려움

지능을 갖고 있는 기능을 갖춘 컴퓨터 시스템이며 , 인간의 지능을 기계등에 인공적으로 구현것을 말함 

튜링 테스트 :
지능의 조작적 정의 
조작정 정의 : 측정할 수 있는 조건으로 어떤 속성을 기술 

강한 인공지능 :
사람고 같은 지능 
마음을 가지고 사람철머 느끼면서 지능적으로 행동하는 기계 
추론 , 문제해결 ,판단 , 계획 , 의사소통 , 자아 의식 
감정 , 지혜 , 양식 

약한 인공지능 : 
특정 문제를 해결하는 지능적 행동 
사람의 지능적 행동을 흉내 낼 수 있는 수준 
대부분의 인공지능 접근 방향 

인공지능 단독으로가 아니라 내가 한 전문가를 인공지능과 결합한다면 굉장히 다양한 분야로 나갈 수 있다.

기계 학습 - 지도학습
회귀 :
어떤 데이터들의 "특징" 을 기준으로 연속된 값을 예측하는 문제 

입력(문제)과 대응하는 출력(답)을 데이터로 제공하고 대응관계의 (함수)또는 (패턴)을 찾는 것

기계 학습 - 비지도 학습
답이 없는 문제들만 있는 데이터들로 부터 패턴을 추출하는 것 

인공지능의 요소 기술 
계획 수립 
현재상태에서 목표하는 상태에 도달하기 위해 수행해야 할 일련의 행동 순서를 결정하는 것 
작업 수행 절차 기획 
로봇의 움직임 기획

패턴인식 :
데이터에 있는 패턴이나 규칙성을 찾는 것 
문자 인식 : 인쇄체 , 필기체 
음성 인식 , 영상 인식 
텍스트 패턴 인식 (텍스트 마이닝)
센서 신호 인식 (레이다, 라이다 , 소나 등)
이상치 탐지

인공지능의 주요 응용 분야 
자연어 처리 : 
사람이 사용하는 일반언어로 작성된 문설르 처리하고 이해하는 분야 
자연어 문장 => 형태소 분석 ,구문분석 , 의미 분석 , 화용 분석 => 분석 결과

음성 인식 :
사람의 음성 언어를 컴퓨터가 해석해 그 내용을 문자데이터로 전환하는 처리 

컴퓨터를 비전 :
컴퓨터를 이용하여 시각 기능을 갖는 기계장치를 만들려는 분야 

에이전트 :
사용자로부터 위임받은 일을 자율적으로 수행하는 시스템

네트워크 보안 , 영상처리 , 윈도우 프로그래밍 

가슴이 따듯한 프로그래머가 되어야 합니다. 프로그램을 고민할 떄는 늘 그 중심에 사람이 있어야 합니다.'''

# 텐서플로우 , 케라스 , 테아노 , 파이토치(CUDA를 설치해야 함) , 아파치 , CNTK(마이크로 소프트) , openvino툴킷


